{
  "arxiv_id": "1405.0907",
  "found": true,
  "title": "The variable stellar wind of Rigel probed at high spatial and spectral resolution",
  "authors": [
    "O. Chesneau",
    "A. Kaufer",
    "O. Stahl",
    "C. Colvinter",
    "A. Spang",
    "L. Dessart",
    "R. Prinja",
    "R. Chini"
  ],
  "first_author": "O. Chesneau",
  "summary": "We present a spatially resolved, high-spectral resolution (R=12000) K-band temporal monitoring of Rigel using AMBER at the VLTI. Rigel was observed in the Bracket Gamma line and its nearby continuum in 2006-2007, and 2009-2010. These unprecedented observations were complemented by contemporaneous optical high-resolution spectroscopy. We analyse the near-IR spectra and visibilities with the 1D non-LTE radiative-transfer code CMFGEN. The differential and closure phase signal exhibit asymmetries that are interpreted as perturbations of the wind. A systematic visibility decrease is observed across the Bracket Gamma. During the 2006-2007 period the Bracket Gamma and likely the continuum forming regions were larger than in the 2009-2010 epoch. Using CMFGEN, we infer a mass-loss rate change of about 20% between the two epochs. We further find time variations in the differential visibilities and phases. The 2006-2007 period is characterized by noticeable variations of the differential visibilities in Doppler position and width and by weak variations in differential and closure phase. The 2009-2010 period is much more quiet with virtually no detectable variations in the dispersed visibilities but a strong S-shape signal is observed in differential phase coinciding with a strong ejection event discernible in the optical spectra. The differential phase signal that is sometimes detected is reminiscent of the signal computed from hydrodynamical models of corotating interaction regions. For some epochs the temporal evolution of the signal suggests the rotation of the circumstellar structures.",
  "primary_category": "astro-ph.SR",
  "categories": [
    "astro-ph.SR"
  ],
  "published": "2014-05-05T14:21:35+00:00",
  "updated": "2014-05-05T14:21:35+00:00",
  "doi": "10.1051/0004-6361/201322894",
  "journal_ref": null,
  "comment": "Paper accepted in the A&A journal",
  "pdf_url": "https://arxiv.org/pdf/1405.0907v1",
  "entry_id": "http://arxiv.org/abs/1405.0907v1"
}