{
  "arxiv_id": "1604.07700",
  "found": true,
  "title": "Pseudomagnitudes and Differential Surface Brightness: Application to the apparent diameter of stars",
  "authors": [
    "Alain Chelli",
    "Gilles Duvert",
    "Laurent Bourgès",
    "Guillaume Mella",
    "Sylvain Lafrasse",
    "Daniel Bonneau",
    "Olivier Chesneau"
  ],
  "first_author": "Alain Chelli",
  "summary": "The diameter of a star is a major observable that serves to test the validity of stellar structure theories. It is also a difficult observable that is mostly obtained with indirect methods since the stars are so remote. Today only ~600 apparent star diameters have been measured by direct methods: optical interferometry and lunar occultations. Accurate star diameters are now required in the new field of exoplanet studies, since they condition the planets' sizes in transit observations, and recent publications illustrate a visible renewal of interest in this topic.\n  Our analysis is based on the modeling of the relationship between measured angular diameters and photometries. It makes use of two new reddening-free concepts: a distance indicator called pseudomagnitude, and a quasi-experimental observable that is independent of distance and specific to each star, called the differential surface brightness (DSB). The use of all the published measurements of apparent diameters that have been collected so far, and a careful modeling of the DSB allow us to estimate star diameters with a median statistical error of 1%, knowing their spectral type and, in the present case, the VJHKs photometries.\n  We introduce two catalogs, the JMMC Measured Diameters Catalog (JMDC), containing measured star diameters, and the second version of the JMMC Stellar Diameter Catalog (JSDC), augmented to about 453000 star diameters. Finally, we provide simple formulas and a table of coefficients to quickly estimate stellar angular diameters and associated errors from (V, Ks) magnitudes and spectral types.",
  "primary_category": "astro-ph.SR",
  "categories": [
    "astro-ph.SR"
  ],
  "published": "2016-04-26T14:52:39+00:00",
  "updated": "2016-04-26T14:52:39+00:00",
  "doi": "10.1051/0004-6361/201527484",
  "journal_ref": "Astronomy & Astrophysics, 2016, Volume 589, A112",
  "comment": "9 pages, 4 figures, 2 tables + tables electronically available on http://www.jmmc.fr/jmdc and http://www.jmmc.fr/jsdc",
  "pdf_url": "https://arxiv.org/pdf/1604.07700v1",
  "entry_id": "http://arxiv.org/abs/1604.07700v1"
}