{
  "arxiv_id": "2410.06569",
  "found": true,
  "title": "Open loop calibration and closed loop non-perturbative estimation of the lateral errors of an adaptive optics system: examples with GRAVITY+ and CHARA experimental data",
  "authors": [
    "Anthony Berdeu",
    "Henri Bonnet",
    "Jean-Baptiste Le Bouquin",
    "Johann Kolb",
    "Guillaume Bourdarot",
    "Philippe Berio",
    "Thibaut Paumard",
    "Frank Eisenhauer",
    "Christian Straubmeier",
    "Paulo Garcia",
    "Sebastian Hönig",
    "Florentin Millour",
    "Laura Kreidberg",
    "Denis Defrère",
    "Ferréol Soulez",
    "Denis Mourard",
    "Gail Schaefer",
    "Narsireddy Anugu"
  ],
  "first_author": "Anthony Berdeu",
  "summary": "Performances of an adaptive optics (AO) system are directly linked with the quality of its alignment. During the instrument calibration, having open loop fast tools with a large capture range are necessary to quickly assess the system misalignment and to drive it towards a state allowing to close the AO loop. During operation, complex systems are prone to misalignments (mechanical flexions, rotation of optical elements, etc.) that potentially degrade the AO performances, creating a need for a monitoring tool to tackle their driftage. In this work, we first present an improved perturbative method to quickly assess large lateral errors in open loop. It uses the spatial correlation of the measured interaction matrix of a limited number of 2D spatial modes with a synthetic model. Then, we introduce a novel solution to finely measure and correct these lateral errors via the closed loop telemetry. Non-perturbative, this method consequently does not impact the science output of the instrument. It is based on the temporal correlation of 2D spatial frequencies in the deformable mirror commands. It is model-free (no need of an interaction matrix model) and sparse in the Fourier space, making it fast and easily scalable to complex systems such as future extremely large telescopes. Finally, we present some results obtained on the development bench of the GRAVITY+ extreme AO system (Cartesian grid, 1432 actuators). In addition, we show with on-sky results gathered with CHARA and GRAVITY/CIAO that the method is adaptable to non-conventional AO geometries (hexagonal grids, 60 actuators).",
  "primary_category": "eess.SP",
  "categories": [
    "eess.SP",
    "astro-ph.IM"
  ],
  "published": "2024-10-09T06:06:26+00:00",
  "updated": "2024-10-09T06:06:26+00:00",
  "doi": null,
  "journal_ref": null,
  "comment": null,
  "pdf_url": "https://arxiv.org/pdf/2410.06569v1",
  "entry_id": "http://arxiv.org/abs/2410.06569v1"
}