{
  "arxiv_id": "2509.23357",
  "found": true,
  "title": "Landing with the Score: Riemannian Optimization through Denoising",
  "authors": [
    "Andrey Kharitenko",
    "Zebang Shen",
    "Riccardo de Santi",
    "Niao He",
    "Florian Doerfler"
  ],
  "first_author": "Andrey Kharitenko",
  "summary": "Under the data manifold hypothesis, high-dimensional data are concentrated near a low-dimensional manifold. We study the problem of Riemannian optimization over such manifolds when they are given only implicitly through the data distribution, and the standard manifold operations required by classical algorithms are unavailable. This formulation captures a broad class of data-driven design problems that are central to modern generative AI. Our key idea is to introduce a link function that connects the data distribution to the geometric operations needed for optimization. We show that this function enables the recovery of essential manifold operations, such as retraction and Riemannian gradient computation. Moreover, we establish a direct connection between our construction and the score function in diffusion models of the data distribution. This connection allows us to leverage well-studied parameterizations, efficient training procedures, and even pretrained score networks from the diffusion model literature to perform optimization. Building on this foundation, we propose two efficient inference-time algorithms -- Denoising Landing Flow (DLF) and Denoising Riemannian Gradient Descent (DRGD) -- and provide theoretical guarantees for both feasibility (approximate manifold adherence) and optimality (small Riemannian gradient norm). Finally, we demonstrate the effectiveness of our approach on finite-horizon reference tracking tasks in data-driven control, highlighting its potential for practical generative and design applications.",
  "primary_category": "cs.LG",
  "categories": [
    "cs.LG",
    "math.OC",
    "stat.ML"
  ],
  "published": "2025-09-27T15:10:54+00:00",
  "updated": "2025-09-27T15:10:54+00:00",
  "doi": null,
  "journal_ref": null,
  "comment": "37 pages, 9 figures",
  "pdf_url": "https://arxiv.org/pdf/2509.23357v1",
  "entry_id": "http://arxiv.org/abs/2509.23357v1"
}