{
  "arxiv_id": "2510.09658",
  "found": true,
  "title": "Gradient-Sign Masking for Task Vector Transport Across Pre-Trained Models",
  "authors": [
    "Filippo Rinaldi",
    "Aniello Panariello",
    "Giacomo Salici",
    "Fengyuan Liu",
    "Marco Ciccone",
    "Angelo Porrello",
    "Simone Calderara"
  ],
  "first_author": "Filippo Rinaldi",
  "summary": "When a new release of a foundation model is published, practitioners typically need to repeat full fine-tuning, even if the same task has already been solved in the previous version. A promising alternative is to reuse the parameter changes (i.e., task vectors) that capture how a model adapts to a specific task. However, they often fail to transfer across different pre-trained models due to their misaligned parameter space. In this work, we show that the key to successful transfer lies in the sign structure of the gradients of the new model. Based on this insight, we propose GradFix, a novel method that approximates the ideal gradient sign structure and leverages it to transfer knowledge using only a handful of labeled samples. Notably, this requires no additional fine-tuning: the adaptation is achieved by computing a few gradients at the target model and masking the source task vector accordingly. This yields an update that is locally aligned with the target loss landscape, effectively rebasing the task vector onto the new pre-training. We provide a theoretical guarantee that our method ensures first-order descent. Empirically, we demonstrate significant performance gains on vision and language benchmarks, consistently outperforming naive task vector addition and few-shot fine-tuning.",
  "primary_category": "cs.LG",
  "categories": [
    "cs.LG",
    "cs.AI",
    "cs.CV"
  ],
  "published": "2025-10-07T13:30:25+00:00",
  "updated": "2025-10-16T16:13:33+00:00",
  "doi": null,
  "journal_ref": null,
  "comment": null,
  "pdf_url": "https://arxiv.org/pdf/2510.09658v2",
  "entry_id": "http://arxiv.org/abs/2510.09658v2"
}