{
  "arxiv_id": "2510.05818",
  "found": true,
  "title": "An interferometric mid-infrared study of the eruptive star binary Z CMa with MATISSE/VLTI. I. Imaging the protoplanetary disks during the 2023 outburst",
  "authors": [
    "F. Lykou",
    "J. Varga",
    "F. Cruz-Saénz de Miera",
    "P. Ábrahám",
    "Á. Kóspál",
    "B. Lopez",
    "T. Henning",
    "S. Wolf",
    "G. Weigelt",
    "F. Millour",
    "M. Hogerheijde",
    "L. Chen",
    "T. Ratzka",
    "W. Danchi",
    "P. Boley",
    "J. -C. Augereau",
    "P. Priolet"
  ],
  "first_author": "F. Lykou",
  "summary": "The mid-infrared (MIR) emitting regions of the individual protoplanetary disks in the binary system Z CMa are resolved by MATISSE/VLTI. The observations were obtained during a serendipitous large outburst of the HBe star that lasted more than 100 days, while the FUor companion is presumed to be in quiescence. The size of the MIR-emitting disk region of the more massive HBe star increases toward longer wavelengths from $<14$ mas at 3.5$μm$ to $\\ll 50$ mas at 11.5$μm$ . The lack of substructures in the HBe disk might suggest that it is a continuous disk; however, this could be due to observational constraints. We also note a radial variation of the silicate absorption feature over the disk, where the optical depth increases inwards of $<$40~au radii. This contradicts the scenario of a carved, dusty cocoon surrounding the HBe star. In the case of the less massive FUor companion, the MIR-emitting region is much smaller with an angular size $\\leq$15 mas (or else a physical radius $<9$ au) in all bands, suggesting a compact disk. Both disks are aligned within uncertainties, and their orientation agrees with that of the known jets. Furthermore, MATISSE data place the binary's separation at $117.88 \\pm 0.73$ mas and a position angle of $139.16^o\\,\\pm\\,0.29^o$ east of north. Our estimates for the orbital elements gave an eccentric orbit ($e\\sim0.17$) with a moderate inclination ($i\\sim 66$\\degr). The derived total mass is $M_{\\rm total} = 16.4^{+2.1}_{-2.3}$ M$_\\odot$, while the period is approximately 950 years. Our MATISSE imaging of the Herbig disk during outburst indicates a temperature gradient for the disk, while imaging of the FUor companion's disk corroborates previous studies showing that FUor disks are rather compact in the MIR. We cannot infer any misalignment between the MATISSE results and earlier ALMA/JVLA data, nor can we infer any influence from the alleged flyby event.",
  "primary_category": "astro-ph.SR",
  "categories": [
    "astro-ph.SR",
    "astro-ph.EP"
  ],
  "published": "2025-10-07T11:39:14+00:00",
  "updated": "2025-10-07T11:39:14+00:00",
  "doi": "10.1051/0004-6361/202453374",
  "journal_ref": null,
  "comment": "25 pages, 21 figures, accepted for publication in Astronomy & Astrophysics",
  "pdf_url": "https://arxiv.org/pdf/2510.05818v1",
  "entry_id": "http://arxiv.org/abs/2510.05818v1"
}