{
  "arxiv_id": "2511.22640",
  "found": true,
  "title": "Flow Density Control: Generative Optimization Beyond Entropy-Regularized Fine-Tuning",
  "authors": [
    "Riccardo De Santi",
    "Marin Vlastelica",
    "Ya-Ping Hsieh",
    "Zebang Shen",
    "Niao He",
    "Andreas Krause"
  ],
  "first_author": "Riccardo De Santi",
  "summary": "Adapting large-scale foundation flow and diffusion generative models to optimize task-specific objectives while preserving prior information is crucial for real-world applications such as molecular design, protein docking, and creative image generation. Existing principled fine-tuning methods aim to maximize the expected reward of generated samples, while retaining knowledge from the pre-trained model via KL-divergence regularization. In this work, we tackle the significantly more general problem of optimizing general utilities beyond average rewards, including risk-averse and novelty-seeking reward maximization, diversity measures for exploration, and experiment design objectives among others. Likewise, we consider more general ways to preserve prior information beyond KL-divergence, such as optimal transport distances and Renyi divergences. To this end, we introduce Flow Density Control (FDC), a simple algorithm that reduces this complex problem to a specific sequence of simpler fine-tuning tasks, each solvable via scalable established methods. We derive convergence guarantees for the proposed scheme under realistic assumptions by leveraging recent understanding of mirror flows. Finally, we validate our method on illustrative settings, text-to-image, and molecular design tasks, showing that it can steer pre-trained generative models to optimize objectives and solve practically relevant tasks beyond the reach of current fine-tuning schemes.",
  "primary_category": "cs.LG",
  "categories": [
    "cs.LG"
  ],
  "published": "2025-11-27T17:19:01+00:00",
  "updated": "2025-11-27T17:19:01+00:00",
  "doi": null,
  "journal_ref": null,
  "comment": "NeurIPS 2025",
  "pdf_url": "https://arxiv.org/pdf/2511.22640v1",
  "entry_id": "http://arxiv.org/abs/2511.22640v1"
}