{
  "arxiv_id": "1106.1746",
  "found": true,
  "title": "The binary Be star δ Sco at high spectral and spatial resolution: Disk geometry and kinematics before the 2011 periastron",
  "authors": [
    "Anthony Meilland",
    "O. Delaa",
    "Philippe Stee",
    "Samer Kanaan",
    "Florentin Millour",
    "Denis Mourard",
    "Daniel Bonneau",
    "Romain Petrov",
    "Nicolas Nardetto",
    "Aurelie Marcotto",
    "Jean-Michel Clausse",
    "Karine Perraut",
    "H. Mcalister",
    "Theo A. Ten Brummelaar",
    "J. Sturmann",
    "L. Sturmann",
    "N. Turner",
    "S. T. Ridgway",
    "C. Farrington",
    "P. J. Goldfinger",
    "C. Farrington"
  ],
  "first_author": "Anthony Meilland",
  "summary": "Classical Be stars are hot non-supergiant stars surrounded by a gaseous circumstellar disk that is responsible for the observed IR-excess and emission lines. The influence of binarity on these phenomena remains controversial. delta Sco is a binary system whose primary suddently began to exhibit the Be phenomenon at the last periastron in 2000. We want to constrain the geometry and kinematics of its circumstellar environment. We observed the star between 2007 and 2010 using spectrally-resolved interferometry with the VLTI/AMBER and CHARA/VEGA instruments. We found orbital elements that are compatible with previous estimates. The next periastron should take place around July 5, 2011 (+- 4,days). We resolved the circumstellar disk in the HAlpha (FWHM = 4.8+-1.5mas), BrGamma (FWHM = 2.9 0.,mas), and the 2.06$ μ$m HeI (FWHM = 2.4+-0.3mas) lines as well as in the K band continuum (FWHM ~2.4mas). The disk kinematics are dominated by the rotation, with a disk expansion velocity on the order of 0.2km/s. The rotation law within the disk is compatible with Keplerian rotation. As the star probably rotates at about 70% of its critical velocity the ejection of matter doesn't seems to be dominated by rotation. However, the disk geometry and kinematics are similar to that of the previously studied quasi-critically rotating Be stars, namely Alpha Ara, Psi Per and 48 Per.",
  "primary_category": "astro-ph.SR",
  "categories": [
    "astro-ph.SR"
  ],
  "published": "2011-06-09T08:53:13+00:00",
  "updated": "2011-06-09T08:53:13+00:00",
  "doi": "10.1051/0004-6361/201116798",
  "journal_ref": null,
  "comment": "A\\&A accepted paper",
  "pdf_url": "https://arxiv.org/pdf/1106.1746v1",
  "entry_id": "http://arxiv.org/abs/1106.1746v1"
}