{
  "arxiv_id": "1407.5966",
  "found": true,
  "title": "V838 Monocerotis: the central star and its environment a decade after outburst",
  "authors": [
    "Olivier Chesneau",
    "Florentin Millour",
    "Orsola De Marco",
    "S. N. Bright",
    "Alain Spang",
    "D. P. K. Banerjee",
    "N. M. Ashok",
    "T. Kaminski",
    "John P. Wisniewski",
    "Anthony Meilland",
    "Eric Lagadec"
  ],
  "first_author": "Olivier Chesneau",
  "summary": "Aims. V838 Monocerotis erupted in 2002, brightened in a series of outbursts, and eventually developed a spectacular light echo. A very red star emerged a few months after the outburst. The whole event has been interpreted as the result of a merger. Methods. We obtained near-IR and mid-IR interferometric observations of V838 Mon with the AMBER and MIDI recombiners located at the Very Large Telescope Interferometer (VLTI) array. The MIDI two-beam observations were obtained with the 8m Unit Telescopes between October 2011 and February 2012. The AMBER three-beam observations were obtained with the compact array (B$\\leq$m) in April 2013 and the long array (B$\\leq$140m) in May 2014, using the 1.8m Auxiliary Telescopes. Results. A significant new result is the detection of a compact structure around V838 Mon, as seen from MIDI data. The extension of the structure increases from a FWHM of 25 mas at 8 μm to 70 mas at 13 μm. At the adopted distance of D = 6.1 $\\pm$ 0.6 kpc, the dust is distributed from about 150 to 400 AU around V838 Mon. The MIDI visibilities reveal a flattened structure whose aspect ratio increases with wavelength. The major axis is roughly oriented around a position angle of -10 degrees, which aligns with previous polarimetric studies reported in the literature. This flattening can be interpreted as a relic of the 2002 eruption or by the influence of the currently embedded B3V companion. The AMBER data provide a new diameter for the pseudo-photosphere, which shows that its diameter has decreased by about 40% in 10yrs, reaching a radius R$_*$ = 750 $\\pm$ 200 R$_{\\odot}$ (3.5 $\\pm$ 1.0 AU). Conclusions. After the 2002 eruption, interpreted as the merging of two stars, it seems that the resulting source is relaxing to a normal state. The nearby environment exhibits an equatorial over-density of dust up to several hundreds of AU.",
  "primary_category": "astro-ph.SR",
  "categories": [
    "astro-ph.SR"
  ],
  "published": "2014-07-22T18:40:42+00:00",
  "updated": "2014-07-22T18:40:42+00:00",
  "doi": "10.1051/0004-6361/201424458",
  "journal_ref": null,
  "comment": "Astronomy and Astrophysics (2014) Will be set by the publisher",
  "pdf_url": "https://arxiv.org/pdf/1407.5966v1",
  "entry_id": "http://arxiv.org/abs/1407.5966v1"
}