{
  "arxiv_id": "1605.07533",
  "found": true,
  "title": "Image modeling of compact starburst clusters: I. R136",
  "authors": [
    "Zeinab Khorrami",
    "Farrokh Vakili",
    "Olivier Chesneau"
  ],
  "first_author": "Zeinab Khorrami",
  "summary": "Continuous progress in data quality from HST, recent multiwavelength high resolution spectroscopy and high contrast imaging from ground adaptive optics on large telescopes need modeling of R136 to understand its nature and evolutionary stage. To produce the best synthesized multiwavelength images of R136 we need to simulate the effect of dynamical and stellar evolution, mass segregation and binary stars fraction on the survival of young massive clusters with the initial parameters of R136 in the LMC, being set to the present knowledge of this famous cluster. We produced a series of 32 young massive clusters using the NBODY6 code. Each cluster was tracked with adequate temporal samples to follow the evolution of R136 during its early stages. To compare the NBODY6 simulations with observational data, we created the synthetic images from the output of the code. We used the TLUSTY and KURUCZ model atmospheres to produce the fluxes in HST/ WFPC2 filters. GENEVA isochrones were used to track the evolution of stars. Then, we derived the observable parameters from synthetic scenes at the spatial resolution of HST/WFPC2 in the F814W filter (790.48nm). Surface brightness profile of the cluster, half-light radius, mass function and neighbor radius were used to select the best representation of R136. We compared the simulations of R136 to its HST imagery by creating synthetic scenes at the same resolution, pixel scale and FOV of the HST. We applied the same photometric analysis of the images as of the real ones. Having extracted the stellar sources, we estimated the mass-function, the surface brightness profile, the half-light radius and the neighbor radius across R136. The interpretation of these criteria point to the fact that an initially non-segregated cluster scenario is more representative of R136. This result pleads for the formation of massive stars by accretion instead of collision.",
  "primary_category": "astro-ph.SR",
  "categories": [
    "astro-ph.SR",
    "astro-ph.GA"
  ],
  "published": "2016-05-24T16:31:22+00:00",
  "updated": "2016-05-24T16:31:22+00:00",
  "doi": null,
  "journal_ref": null,
  "comment": "18 pages, 40 figures",
  "pdf_url": "https://arxiv.org/pdf/1605.07533v1",
  "entry_id": "http://arxiv.org/abs/1605.07533v1"
}