{
  "arxiv_id": "2410.08563",
  "found": true,
  "title": "Simplified model(s) of the GRAVITY+ adaptive optics system(s) for performance prediction",
  "authors": [
    "Anthony Berdeu",
    "Jean-Baptiste Le Bouquin",
    "Guillaume Mella",
    "Laurent Bourgès",
    "Jean-Philippe Berger",
    "Guillaume Bourdarot",
    "Thibaut Paumard",
    "Frank Eisenhauer",
    "Christian Straubmeier",
    "Paulo Garcia",
    "Sebastian Hönig",
    "Florentin Millour",
    "Laura Kreidberg",
    "Denis Defrère",
    "Ferréol Soulez",
    "Taro Shimizu"
  ],
  "first_author": "Anthony Berdeu",
  "summary": "In the context of the GRAVITY+ upgrade, the adaptive optics (AO) systems of the GRAVITY interferometer are undergoing a major lifting. The current CILAS deformable mirrors (DM, 90 actuators) will be replaced by ALPAO kilo-DMs (43x43, 1432 actuators). On top of the already existing 9x9 Shack-Hartmann wavefront sensors (SH-WFS) for infrared (IR) natural guide star (NGS), new 40x40 SH-WFSs for visible (VIS) NGS will be deployed. Lasers will also be installed on the four units of the Very Large Telescope to provide a laser guide star (LGS) option with 30x30 SH-WFSs and with the choice to either use the 9x9 IR-WFSs or 2x2 VIS-WFSs for low order sensing. Thus, four modes will be available for the GRAVITY+ AO system (GPAO): IR-NGS, IR-LGS, VIS-NGS and VIS-LGS. To prepare the instrument commissioning and help the observers to plan their observations, a tool is needed to predict the performances of the different modes and for different observing conditions (NGS magnitude, science object magnitude, turbulence conditions...) We developed models based on a Mar{é}chal approximation to predict the Strehl ratio of the four GPAO modes in order to feed the already existing tool that simulates the GRAVITY performances. Waiting for commissioning data, our model was validated and calibrated using the TIPTOP toolbox, a Point Spread Function simulator based on the computation of Power Spectrum Densities. In this work, we present our models of the NGS modes of GPAO and their calibration with TIPTOP.",
  "primary_category": "astro-ph.IM",
  "categories": [
    "astro-ph.IM"
  ],
  "published": "2024-10-11T06:38:36+00:00",
  "updated": "2024-10-11T06:38:36+00:00",
  "doi": "10.1117/12.3019865",
  "journal_ref": "Adaptive Optics Systems IX, Jun 2024, Yokohama, France. pp.199",
  "comment": null,
  "pdf_url": "https://arxiv.org/pdf/2410.08563v1",
  "entry_id": "http://arxiv.org/abs/2410.08563v1"
}