{
  "arxiv_id": "2502.01840",
  "found": true,
  "title": "Direct imaging of AGN outflows and their origin with the 23 m Large Binocular Telescope",
  "authors": [
    "Jacob W. Isbell",
    "Steve Ertel",
    "Jörg-Uwe Pott",
    "Gerd Weigelt",
    "Marko Stalevski",
    "James Leftley",
    "Walter Jaffe",
    "Romain G. Petrov",
    "Niklas Moszczynski",
    "Pierre Vermot",
    "Philip Hinz",
    "Leonard Burtscher",
    "Violeta Gámez Rosas",
    "Alexander Becker",
    "Jared Carlson",
    "Virginie Faramaz-Gorka",
    "William F. Hoffmann",
    "Jarron Leisenring",
    "Jennifer Power",
    "Kevin Wagner"
  ],
  "first_author": "Jacob W. Isbell",
  "summary": "Active galactic nuclei (AGNs) are a key component of galaxy evolution due to feedback on the host from its supermassive black hole. The morphology of warm, in- and outflowing dusty material can reveal the nature of the onset of feedback, AGN feeding, and the unified model of AGN. Here we use the Large Binocular Telescope Interferometer (LBTI) to image the dense, obscuring disk and extended dusty outflow region of NGC 1068. In Fizeau imaging mode the LBTI synthesizes the equivalent resolution of a 22.8 m telescope. The 8.7 $μ$m Fizeau images of NGC 1068 {have an effective resolution of $47\\times90$ mas ($3.3\\times6.2$ pc)} in a 5\" field of view after performing PSF deconvolution techniques described here. This is the only extragalactic source to be Fizeau imaged using the LBTI, and the images bridge the scales measured with the Very Large Telescope Interferometer (VLTI; 0.5-5 pc) and those of single telescopes such as JWST and Keck ($>15$ pc). The images detect and spatially resolve the low surface brightness mid-infrared (MIR) features in the AGN disk/wind region that are over-resolved by the VLTI. The images show strong correlation between MIR dust emission and near-infrared (NIR) emission of highly excited atomic lines observed by SINFONI. Such LBTI imaging is a precursor to infrared imaging using the upcoming generation of extremely large telescopes, with angular resolutions up to 6x better than JWST, the largest space telescope in orbit.",
  "primary_category": "astro-ph.GA",
  "categories": [
    "astro-ph.GA"
  ],
  "published": "2025-02-03T21:32:27+00:00",
  "updated": "2025-02-03T21:32:27+00:00",
  "doi": "10.1038/s41550-024-02461-y",
  "journal_ref": null,
  "comment": "26 Pages, Accepted for publication in Nature Astronomy",
  "pdf_url": "https://arxiv.org/pdf/2502.01840v1",
  "entry_id": "http://arxiv.org/abs/2502.01840v1"
}