{
  "arxiv_id": "2502.11722",
  "found": true,
  "title": "Evidence for an accretion bridge in the DX Cha circumbinary system from VLTI/MATISSE observations",
  "authors": [
    "Tímea Juhász",
    "József Varga",
    "Péter Ábrahám",
    "Ágnes Kóspál",
    "Foteini Lykou",
    "Lei Chen",
    "Attila Moór",
    "Fernando Cruz-Sáenz de Miera",
    "Bruno Lopez",
    "Alexis Matter",
    "Roy van Boekel",
    "Michiel Hogerheijde",
    "Margaux Abello",
    "Jean-Charles Augereau",
    "Paul Boley",
    "William C. Danchi",
    "Thomas Henning",
    "Mathis Letessier",
    "Jie Ma",
    "Philippe Priolet",
    "Marten Scheuck",
    "Gerd Weigelt",
    "Sebastian Wolf"
  ],
  "first_author": "Tímea Juhász",
  "summary": "DX Cha (HD 104237) is a spectroscopic binary consisting of a Herbig A7.5Ve-A8Ve primary star and a K3-type companion. Here we report on new $3.55$ micrometer interferometric observations of this source with the Multi Aperture Mid-Infrared Spectroscopic Experiment (MATISSE) at the Very Large Telescope Interferometer (VLTI). To model the four MATISSE observations obtained between 2020 and 2023, we constructed a time-dependent interferometric model of the system, using the oimodeler software. The model consists of an asymmetric ring and two point sources on a Keplerian orbit. Our best-fit model consists of a circumbinary ring with a diameter of $0.86$ au ($8.1$ mas), featuring a strong azimuthal asymmetry. We found that the position angle of the asymmetry changes tens of degrees between the MATISSE epochs. The ring is relatively narrow, with a full width at half maximum (FWHM) of $\\sim$$0.13$ au ($1.23$ mas). The presence of circumstellar dust emission so close to the binary is unexpected, as previous hydrodynamic simulations predicted an inner disk cavity with a diameter of $\\sim$$4$ au ($\\sim$$37.5$ mas). Thus, we argue that the narrow envelope of material we detected is probably not a gravitationally stable circumbinary ring, but may be part of tidal accretion streamers channeling material from the inner edge of the disk toward the stars.",
  "primary_category": "astro-ph.SR",
  "categories": [
    "astro-ph.SR",
    "astro-ph.EP",
    "astro-ph.GA"
  ],
  "published": "2025-02-17T12:10:14+00:00",
  "updated": "2025-02-17T12:10:14+00:00",
  "doi": null,
  "journal_ref": null,
  "comment": "Accepted for publication in ApJ, 11 pages, 5 figures, 5 tables",
  "pdf_url": "https://arxiv.org/pdf/2502.11722v1",
  "entry_id": "http://arxiv.org/abs/2502.11722v1"
}