{
  "arxiv_id": "2502.18856",
  "found": true,
  "title": "Spectroastrometry and Reverberation Mapping of Active Galactic Nuclei. II. Measuring Geometric Distances and Black Hole Masses of Four Nearby Quasars",
  "authors": [
    "Yan-Rong Li",
    "Jinyi Shangguan",
    "Jian-Min Wang",
    "Ric Davies",
    "Daryl J. Santos",
    "Frank Eisenhauer",
    "Yu-Yang Songsheng",
    "Hartmut Winkler",
    "Jesús Aceituno",
    "Hua-Rui Bai",
    "Jin-Ming Bai",
    "Michael S. Brotherton",
    "Yixian Cao",
    "Yong-Jie Chen",
    "Pu Du",
    "Feng-Na Fang",
    "Jia-Qi Feng",
    "Helmut Feuchtgruber",
    "Natascha M. Förster Schreiber",
    "Yi-Xin Fu",
    "Reinhard Genzel",
    "Stefan Gillessen",
    "Luis C. Ho",
    "Chen Hu",
    "Jun-Rong Liu",
    "Dieter Lutz",
    "Thomas Ott",
    "Romain G. Petrov",
    "Sebastian Rabien",
    "Taro Shimizu",
    "Eckhard Sturm",
    "Linda J. Tacconi",
    "Yi-Lin Wang",
    "Zhu-Heng Yao",
    "Shuo Zhai",
    "Hao Zhang",
    "Yi-Peng Zhao",
    "Yu Zhao"
  ],
  "first_author": "Yan-Rong Li",
  "summary": "The geometric distances of active galactic nuclei (AGNs) are challenging to measure because of their exceptionally compact structure yet vast cosmic distances. A combination of spectroastrometry and reverberation mapping (SARM) of broad-line regions (BLRs) constitutes a novel means to probe the geometric distance of AGNs, which has recently become practically feasible owing to successful interferometric observations with VLTI/GRAVITY. Here, we perform SARM analysis of four nearby quasars: Mrk 509, PDS 456, 3C 273, and NGC 3783. Results for the former two are reported for the first time and the latter two are revisited using our improved BLR dynamical modeling that includes the radial-dependent responsivity of BLRs. This allows us to self-consistently account for the emissivity weighting of the BLR in spectroastrometry and responsivity weighting in reverberation mapping. We obtain angular-diameter distances of the four quasars, from which we derive a Hubble constant of $H_0=69_{-10}^{+12}\\,\\rm km\\,s^{-1}\\,Mpc^{-1}$. Although this constitutes a large uncertainty for a measurement of $H_0$, it is anticipated that the precision will improve to a competitive level once a greater number of AGNs are accessible following the upgrade of GRAVITY in the near future. From SARM analysis, the black hole masses of the four quasars are also measured with the statistical uncertainty ranging from 0.06 to 0.23 dex, consistent with the correlations between black hole masses and properties of the host bulges.",
  "primary_category": "astro-ph.GA",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO"
  ],
  "published": "2025-02-26T05:54:45+00:00",
  "updated": "2025-06-28T15:13:10+00:00",
  "doi": "10.3847/1538-4357/addf40",
  "journal_ref": null,
  "comment": "21 pages, 15 figures, 4 tables; ApJ in press",
  "pdf_url": "https://arxiv.org/pdf/2502.18856v2",
  "entry_id": "http://arxiv.org/abs/2502.18856v2"
}