{
  "arxiv_id": "2502.02738",
  "found": true,
  "title": "Dynamic Imprints of Colliding-wind Dust Formation from WR140",
  "authors": [
    "Emma P. Lieb",
    "Ryan M. Lau",
    "Jennifer L. Hoffman",
    "Michael F. Corcoran",
    "Macarena Garcia Marin",
    "Theodore R. Gull",
    "Kenji Hamaguchi",
    "Yinuo Han",
    "Matthew J. Hankins",
    "Olivia C. Jones",
    "Thomas I. Madura",
    "Sergey V. Marchenko",
    "Hideo Matsuhara",
    "Florentin Millour",
    "Anthony F. J. Moffat",
    "Mark R. Morris",
    "Patrick W. Morris",
    "Takashi Onaka",
    "Marshall D. Perrin",
    "Armin Rest",
    "Noel Richardson",
    "Christopher M. P. Russell",
    "Joel Sanchez-Bermudez",
    "Anthony Soulain",
    "Peter Tuthill",
    "Gerd Weigelt",
    "Peredur M. Williams"
  ],
  "first_author": "Emma P. Lieb",
  "summary": "Carbon-rich Wolf-Rayet binaries are a prominent source of carbonaceous dust that contribute to the dust budget of galaxies. The \"textbook\" example of an episodic dust producing WR binary, WR140 (HD193793), provides us with an ideal laboratory for investigating the dust physics and kinematics in an extreme environment. This study is among the first to utilize two separate JWST observations, from Cycle 1 ERS (July 2022) and Cycle 2 (Sept. 2023), to measure WR140's dust kinematics and confirm its morphology. To measure the proper motions and projected velocities of the dust shells, we performed a novel PSF subtraction to reduce the effects of the bright diffraction spikes and carefully aligned the Cycle 2 to the Cycle 1 images. At 7.7 $μ$m, through the bright feature common to 16 dust shells (C1), we find an average dust shell proper motion of $390\\pm29$ mas yr$^{-1}$, which equates to a projected velocity of $2714\\pm188$ km s$^{-1}$ at a distance of 1.64 kpc. Our measured speeds are constant across all visible shells and consistent with previously reported dust expansion velocities. Our observations not only prove that these dusty shells are astrophysical (i.e., not associated with any PSF artifact) and originate from WR140, but also confirm the \"clumpy\" morphology of the dust shells, in which identifiable substructures within certain shells persist for at least 14 months from one cycle to the next. These results support the hypothesis that clumping in the wind collision region is required for dust production in WR binaries.",
  "primary_category": "astro-ph.GA",
  "categories": [
    "astro-ph.GA",
    "astro-ph.SR"
  ],
  "published": "2025-02-04T21:50:33+00:00",
  "updated": "2025-02-04T21:50:33+00:00",
  "doi": "10.3847/2041-8213/ad9aa9",
  "journal_ref": "The ApJL Vol. 979 (2025) Num. 1",
  "comment": null,
  "pdf_url": "https://arxiv.org/pdf/2502.02738v1",
  "entry_id": "http://arxiv.org/abs/2502.02738v1"
}