{
  "arxiv_id": "2509.01026",
  "found": true,
  "title": "The Aromatic Infrared Bands around the Wolf-Rayet Binary WR140 Revealed by JWST",
  "authors": [
    "Kotomi Taniguchi",
    "Ryan M. Lau",
    "Takashi Onaka",
    "Macarena Garcia Marin",
    "Hideo Matsuhara",
    "Anthony Moffat",
    "Theodore R. Gull",
    "Thomas I. Madura",
    "Gerd Weigelt",
    "Riko Senoo",
    "Alan T. Tokunaga",
    "Walter Duley",
    "Peredur M. Williams",
    "Noel D. Richardson",
    "Joel Sanchez-Bermudez"
  ],
  "first_author": "Kotomi Taniguchi",
  "summary": "We have analyzed the aromatic infrared bands (AIBs) in the 6-11.2 $μ$m range around the Wolf-Rayet binary WR140 (d=1.64 kpc) obtained with the James Webb Space Telescope (JWST) Mid-Infrared Instrument (MIRI) Medium-Resolution Spectrometer (MRS). In WR140's circumstellar environment, we have detected AIBs at 6 $μ$m and 7.7 $μ$m which are attributed to C-C stretching modes. These features have been detected in the innermost dust shell (Shell1; ~2100 au from WR140), the subsequent dust shell (Shell2; ~5200 au), and ``off-shell'' regions in the MRS coverage. The 11.2 $μ$m AIB, which is associated with the C-H out-of-plane bending mode, has been tentatively detected in Shell2 and the surrounding off-shell positions around Shell2. We compared the AIB features from WR140 to spectra of established AIB feature classes A, B, C, and D. The detected features around WR140 do not agree with these established classes. The peak wavelengths and full width half maxima (FWHMs) of the 6 $μ$m and 7.7 $μ$m features are, however, consistent with those of R Coronae Borealis (RCB) stars with hydrogen-poor conditions. We discuss a possible structure of carbonaceous compounds and environments where they form around WR140. It is proposed that hydrogen-poor carbonaceous compounds initially originate from the carbon-rich WR wind, and the hydrogen-rich stellar wind from the companion O star may provide hydrogen to these carbonaceous compounds.",
  "primary_category": "astro-ph.SR",
  "categories": [
    "astro-ph.SR",
    "astro-ph.GA"
  ],
  "published": "2025-08-31T23:35:30+00:00",
  "updated": "2025-08-31T23:35:30+00:00",
  "doi": null,
  "journal_ref": null,
  "comment": "Accepted by the publication in The Astrophysical Journal (ApJ). 17 pages, 10 figures, 2 table",
  "pdf_url": "https://arxiv.org/pdf/2509.01026v1",
  "entry_id": "http://arxiv.org/abs/2509.01026v1"
}