{
  "arxiv_id": "2510.27591",
  "found": true,
  "title": "Multi-band infrared imaging reveals dusty spiral arcs around the binary B[e] star 3 Puppis",
  "authors": [
    "M. Abello",
    "J. Drevon",
    "A. Meilland",
    "A. Domiciano de Souza",
    "F. Millour",
    "R. Flor",
    "J. H. Leftley",
    "C. Paladini",
    "Ph. Stee",
    "A. Matter",
    "S. Lagarde",
    "B. Lopez",
    "P. Ábrahám",
    "J. -C. Augereau",
    "P. Cruzalèbes",
    "W. Danchi",
    "T. Henning",
    "T. Juhász",
    "F. Kerschbaum",
    "F. Lykou",
    "P. Priolet",
    "S. Robbe-Dubois",
    "J. Varga",
    "L. B. F. M. Waters",
    "G. Weigelt",
    "S. Wolf",
    "MATISSE collaboration"
  ],
  "first_author": "M. Abello",
  "summary": "3 Puppis is the brightest known B[e] star. Recent work classifies this A-type object as a supergiant, yet the impact of its binarity on the circumstellar environment (CE) remains hard to characterize. To resolve its dusty region at 5-10 mas, we obtained mid-IR interferometric observations with VLTI/MATISSE over 3-12 μm. Because the (u,v) coverage supports imaging, we introduce a statistical interferometric-imaging workflow based on MiRA to generate averaged images: this systematic approach enables the selection of an optimal set of reconstructions, improving the robustness and fidelity of the recovered features. We also use SPARCO, an independent tool well suited to bright central objects embedded in fainter extended emission. Images from both tools in the L, M, and N bands agree and reveal an asymmetric, elongated feature ~17 mas (~10 au at 631 pc) southeast of the star with ~20% density contrast. A second northwest asymmetry and a skewed inner rim are detected. Simple geometric modelling, guided by the MATISSE images, constrains the morphology, location, and flux of the CE and its asymmetries. The images are consistent with earlier VLTI measurements but expose a more complex CE with large-scale clumps in the southeast and northwest parts of the disc. Hydrodynamic modelling indicates that tidal spiral-wake perturbations from the central binary, dynamically excited at Lindblad resonances in the circumbinary disc, best explain the radial extent and curvature of the elongated structures seen in all bands.",
  "primary_category": "astro-ph.SR",
  "categories": [
    "astro-ph.SR",
    "astro-ph.IM"
  ],
  "published": "2025-10-31T16:14:04+00:00",
  "updated": "2025-10-31T16:14:04+00:00",
  "doi": "10.1051/0004-6361/202556615",
  "journal_ref": "A&A 704, A175 (2025)",
  "comment": "19 pages, 11 figures, 11 tables",
  "pdf_url": "https://arxiv.org/pdf/2510.27591v1",
  "entry_id": "http://arxiv.org/abs/2510.27591v1"
}