{
  "arxiv_id": "2510.12513",
  "found": true,
  "title": "Spectroscopic Reverberation Mapping for SARM: The Case of Mrk 1048 and Mrk 618",
  "authors": [
    "Shivangi Pandey",
    "Suvendu Rakshit",
    "S. Muneer",
    "Jincen Jose",
    "Ashutosh Tomar",
    "Yan-Rong Li",
    "Jian-Min Wang",
    "C. S. Stalin",
    "Jong-Hak Woo",
    "Romain G. Petrov",
    "James Leftley",
    "Sebastian F. Hönig",
    "Amit Kumar Mandal",
    "Tushar Ubarhande",
    "Shu Wang",
    "Michael Brotherton",
    "Archana Gupta"
  ],
  "first_author": "Shivangi Pandey",
  "summary": "Robust extragalactic distance measurements are crucial for resolving the persistent discrepancy in the value of the Hubble constant (H$_0$)). Active Galactic Nuclei (AGNs), through their compact and variable broad-line regions (BLRs), enable the determination of geometric distances when reverberation mapping (RM) is combined with spectroastrometry(SA). We report results from a spectroscopic RM campaign (October 2022 to March 2023) targeting two narrow-line Seyfert 1 galaxies, Mrk 1048 and Mrk 618, using 3.6-m DOT and 2-m HCT. High-cadence spectro-photometric monitoring was carried out using onboard instruments such as ADFOSC, HFOSC, and TANSPEC, resulting in well-sampled continuum and emission line light curves. The observed fractional variability ($F_{\\mathrm{var}}$) ranged from 4% to 14% across the $g$-band, H$β$, and H$α$ light curves. The time lags were measured using the interpolated cross-correlation function (ICCF), PyI$^{2}$CCF, and \\textsc{JAVELIN} methods. In the rest frame, the ICCF analysis yields H$β$ lags of $10.5^{+2.6}_{-4.2}$ days for Mrk 1048 and $10.2^{+3.4}_{-2.9}$ days for Mrk 618, while the corresponding H$α$ lags are $18.7^{+5.3}_{-5.4}$ and $14.4^{+4.6}_{-10.5}$ days, respectively. The emission-line widths, measured from the rms spectra using $σ_{\\mathrm{line}}$, give virial black hole mass estimates of $6.3^{+2.0}_{-2.1} \\times 10^7\\,M_\\odot$ for Mrk 1048 and $1.2^{+0.4}_{-0.6} \\times 10^7\\,M_\\odot$ for Mrk 618. These results will serve as a basis for absolute geometric distance calibration when combined with VLTI/GRAVITY spectro-astrometric measurements, thereby contributing to the development of AGNs as standardizable cosmological probes.",
  "primary_category": "astro-ph.GA",
  "categories": [
    "astro-ph.GA"
  ],
  "published": "2025-10-14T13:42:10+00:00",
  "updated": "2025-10-14T13:42:10+00:00",
  "doi": null,
  "journal_ref": null,
  "comment": "Accepted for Publication in ApJ, 9 figures, 5 tables, 22 pages",
  "pdf_url": "https://arxiv.org/pdf/2510.12513v1",
  "entry_id": "http://arxiv.org/abs/2510.12513v1"
}