{
  "arxiv_id": "2511.18981",
  "found": true,
  "title": "The complex inner disk of the Herbig Ae star HD 100453 with VLTI/MATISSE",
  "authors": [
    "L. N. A. van Haastere",
    "J. Varga",
    "M. R. Hogerheijde",
    "C. Dominik",
    "M. Scheuck",
    "A. Matter",
    "R. van Boekel",
    "B. Lopez",
    "M. Abello",
    "J. -C. Augereau",
    "P. Boley",
    "W. -C. Danchi",
    "V. Gámez Rosas",
    "Th. Henning",
    "K. -H. Hofmann",
    "M. Houllé",
    "W. Jaffe",
    "J. Kobus",
    "E. Kokoulina",
    "L. H. Leftley",
    "M. Letessier",
    "J. Ma",
    "F. Millour",
    "E. Pantin",
    "P. Priolet",
    "D. Schertl",
    "J. Scigliuto",
    "G. Weigelt",
    "S. Wolf",
    "P. Berio",
    "F. Bettonvil",
    "P. Cruzalèbes",
    "M. Heininger",
    "J. W. Isbell",
    "S. Lagarde",
    "A. Meilland",
    "R. Petrov",
    "S. Robbe-Dubois"
  ],
  "first_author": "L. N. A. van Haastere",
  "summary": "The inner regions of planet-forming disks hold invaluable insights for our understanding of planet formation. The disk around the Herbig star HD 100453 presents one such environment, with an inner disk that is significantly misaligned with respect to the outer disk. This paper expands the existing H-band (PIONIER) and K-band (GRAVITY) interferometric studies of the HD 100453 inner disk to the L-band with the MATISSE VLTI instrument. With snapshot data spanning approximately four years we aim for a more comprehensive understanding of the inner disk structures and their potential time evolution. Based on the MATISSE data obtained, we use a combination of analytical models and image reconstruction to constrain the disk structure. Additionally, we fit a temperature gradient model to the selected wavelength range of PIONIER, GRAVITY and MATISSE to derive physical properties of the inner regions. Our parametric model finds an inclination of $\\sim 47.5^\\circ$ and a position angle of $\\sim 83.6^\\circ$, which corroborates the case of strong inner-outer disk misalignment. From the symmetric temperature gradient we derive an inner disk radius around $\\sim0.27$ au, with dust surface densities of $Σ_{\\rm{subl}} \\approx 10^{-3.2}$ g/cm$^2$ and vertical optical depth $τ_{\\rm{z, subl}} \\approx 0.1-0.06$. Same-night MATISSE and GRAVITY observations indicate the necessity for higher-order asymmetries to explain the interferometric signals, which is further supported by a MATISSE snapshot image reconstruction. The chromatic interferometric data reveal the likely need for higher-order asymmetries to explain the inner disk of HD~100453, suggesting a possible origin in dynamic interactions or disk instabilities. Coordinated multi-wavelength infrared interferometric observations with GRAVITY and MATISSE will be crucial to confirm these findings and uncover its underlying nature.",
  "primary_category": "astro-ph.SR",
  "categories": [
    "astro-ph.SR",
    "astro-ph.EP"
  ],
  "published": "2025-11-24T10:55:22+00:00",
  "updated": "2025-11-24T10:55:22+00:00",
  "doi": null,
  "journal_ref": null,
  "comment": "17 pages, 12 figures, accepted for publication in Astronomy & Astrophysics",
  "pdf_url": "https://arxiv.org/pdf/2511.18981v1",
  "entry_id": "http://arxiv.org/abs/2511.18981v1"
}