{
  "arxiv_id": "2511.08309",
  "found": true,
  "title": "The MATISSE view of the inner region of the RY Tau protoplanetary disk",
  "authors": [
    "J. S. Martin",
    "J. Kobus",
    "J. Varga",
    "A. Matter",
    "S. Wolf",
    "M. Abello",
    "F. Allouche",
    "J. -C. Augereau",
    "P. Berio",
    "F. Bettonvil",
    "R. van Boekel",
    "P. A. Boley",
    "P. Cruzalèbes",
    "W. C. Danchi",
    "J. Drevon",
    "C. Dominik",
    "V. Fleury",
    "V. Gámez Rosas",
    "A. Glindemann",
    "L. N. A. van Haastere",
    "M. Heininger",
    "Th. Henning",
    "K. -H. Hofmann",
    "M. Hogerheijde",
    "M. Houllé",
    "J. W. Isbell",
    "W. Jaffe",
    "L. Labadie",
    "S. Lagarde",
    "J. H. Leftley",
    "M. Lehmitz",
    "M. Letessier",
    "B. Lopez",
    "F. Lykou",
    "J. Ma",
    "A. Meilland",
    "F. Millour",
    "C. Paladini",
    "E. Pantin",
    "R. G. Petrov",
    "P. Priolet",
    "S. Robbe-Dubois",
    "D. Schertl",
    "M. Scheuck",
    "J. Scigliuto",
    "G. Weigelt",
    "J. Woillez"
  ],
  "first_author": "J. S. Martin",
  "summary": "The T-Tauri type young stellar object RY Tau exhibits a dust depleted inner cavity characteristic of a transition disk. We constrain the spatial distribution and mineralogy of dust in the RY Tau protoplanetary disk in the inner few astronomical units using spectrally resolved interferometric observations in the L, M, and N bands obtained with VLTI/MATISSE.\n  Employing a 2D temperature gradient model we estimate the orientation of the inner disk finding no evidence of significant misalignment between the inner and outer disk of RY Tau. Successively, we analyze the chemical composition of silicates depending on spatial region in the disk and identify several silicate species commonly found in protoplanetary disks. Additionally, a depletion of amorphous dust grains toward the central protostar is observed. Monte Carlo radiative transfer simulations show that hot dust close to the protostar and in the line of sight to the observer, either in the uppermost disk layers of a strongly flared disk or in a dusty envelope, is necessary to model the observations. The shadow cast by a dense innermost disk midplane on the dust further out explains the observed closure phases in the L band and to some extent in the M band. However, the closure phases in the N band are underestimated by our model, hinting at an additional asymmetry in the flux density distribution not visible at shorter wavelengths.",
  "primary_category": "astro-ph.EP",
  "categories": [
    "astro-ph.EP"
  ],
  "published": "2025-11-11T14:39:05+00:00",
  "updated": "2025-11-11T14:39:05+00:00",
  "doi": null,
  "journal_ref": null,
  "comment": "28 pages, 23 figures, to be published in A&A",
  "pdf_url": "https://arxiv.org/pdf/2511.08309v1",
  "entry_id": "http://arxiv.org/abs/2511.08309v1"
}